# 1.Introduction 
 * This assignment will help you to consolidate the concepts learnt in the session. 
 
 
## 2.Problem Statement 
 
 
It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? 
 
Take this monstrosity as the DataFrame to use in the following puzzles: 
 
    df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 

    'Budapest_PaRis', 'Brussels_londOn'], 

    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 

    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 

    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 

    '12. Air France', '"Swiss Air"']}) 
 
**1**. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column). 
 
 
**2**. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. 
 
 
**3**. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) 
 
**4**. Delete the From_To column from df and attach the temporary DataFrame from the previous questions. 
 
**5**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. 
 
**Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.**

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Take this monstrosity as the DataFrame to use in the following puzzles:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 

                    'Budapest_PaRis', 'Brussels_londOn'], 

                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 

                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 

                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 

                    '12. Air France', '"Swiss Air"']}) 
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [3]:
df.shape

(5, 4)

### Problem Statements

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [4]:
df["FlightNumber"] = df["FlightNumber"].interpolate().astype(int)

In [6]:
df["FlightNumber"]

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [9]:
temp = df["From_To"].str.split("_", expand = True)

In [10]:
temp.columns = ["From", "To"]
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [11]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()

In [12]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [14]:
df.drop("From_To", axis = 1, inplace = True)

In [16]:
df = df.join(temp)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays

In [17]:
delays = df["RecentDelays"].apply(pd.Series)

In [18]:
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

In [19]:
df = df.drop('RecentDelays', axis=1).join(delays)

In [20]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM(!),London,Paris,23.0,47.0,NaN
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN